app/nvmf_iaa/fio_engine/results_lat/128k_latency.out
=== run_latency_pair.sh ===
timestamp: 2026-03-26 15:29:43
bs: 128k
size: 128k
fio: /home/xuanboj2/spdk-iaa/app/nvmf_iaa/fio/fio
engine: ./snic_phase1.so

=== WRITE ===
job0: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=snic_phase1, iodepth=1
fio-3.41-142-g698f
Starting 1 thread
job0: Laying out IO file (1 file / 0MiB)
EAL: '-c <coremask>' option is deprecated, and will be removed in a future release
EAL: 	Use '-l <corelist>' or '--lcores=<corelist>' option instead
[Init] Probing Target 192.168.200.20:4420...
[Init] Attaching to 192.168.200.20
[Init] Attached to NVMe Controller
[Init] Allocated IO QPair. Negotiated QID: 1
[RDMA] Resolving SNIC address 192.168.200.11:18515...
[RDMA] Resolving route...
[RDMA] Connecting to SNIC...
[RDMA] SNIC Connection established!
[Init] Registering Memory...
[Init] Cleaning IAA Completion Buffer
[Init] Mapping IAA Portal at /dev/iax/wq1.0...
[Init] Allocating COMP/DECOMP AECS buffers
[Init] COMP AECS loaded:   addr=0x7a4da4114040 size=1568
[Init] DECOMP AECS loaded: addr=0x7a4da4119140 size=5376
[Init] Initing SETUP MSG...
[Init] All systems OK. Staging Buffer: 32 MB (Hugepages)
[Init] Sending SETUP Message to SNIC...
[SETUP] comp_aecs_addr=0x7a4da4114040 comp_aecs_size=1568
[SETUP] decomp_aecs_addr=0x7a4da4119140 decomp_aecs_size=5376
[Init] SETUP Message Sent successfully.
sizeof(struct snic_setup_msg) = 80

job0: (groupid=0, jobs=1): err= 0: pid=19014: Thu Mar 26 15:29:43 2026
  write: IOPS=500, BW=62.5MiB/s (65.5MB/s)(128KiB/2msec)
    clat (nsec): min=1191.8k, max=1191.8k, avg=1191817.00, stdev= 0.00
     lat (nsec): min=1195.2k, max=1195.2k, avg=1195160.00, stdev= 0.00
    clat percentiles (usec):
     |  1.00th=[ 1188],  5.00th=[ 1188], 10.00th=[ 1188], 20.00th=[ 1188],
     | 30.00th=[ 1188], 40.00th=[ 1188], 50.00th=[ 1188], 60.00th=[ 1188],
     | 70.00th=[ 1188], 80.00th=[ 1188], 90.00th=[ 1188], 95.00th=[ 1188],
     | 99.00th=[ 1188], 99.50th=[ 1188], 99.90th=[ 1188], 99.95th=[ 1188],
     | 99.99th=[ 1188]
  lat (msec)   : 2=100.00%
  cpu          : usr=0.00%, sys=0.00%, ctx=1, majf=0, minf=32
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0.00ns, window=0.00ns, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=62.5MiB/s (65.5MB/s), 62.5MiB/s-62.5MiB/s (65.5MB/s-65.5MB/s), io=128KiB (131kB), run=2-2msec

Disk stats (read/write):
  nvme1n1: ios=0/0, sectors=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%

=== READ ===
job0: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=snic_phase1, iodepth=1
fio-3.41-142-g698f
Starting 1 thread
job0: Laying out IO file (1 file / 0MiB)
EAL: '-c <coremask>' option is deprecated, and will be removed in a future release
EAL: 	Use '-l <corelist>' or '--lcores=<corelist>' option instead
[Init] Probing Target 192.168.200.20:4420...
[Init] Attaching to 192.168.200.20
[Init] Attached to NVMe Controller
[Init] Allocated IO QPair. Negotiated QID: 1
[RDMA] Resolving SNIC address 192.168.200.11:18515...
[RDMA] Resolving route...
[RDMA] Connecting to SNIC...
[RDMA] SNIC Connection established!
[Init] Registering Memory...
[Init] Cleaning IAA Completion Buffer
[Init] Mapping IAA Portal at /dev/iax/wq1.0...
[Init] Allocating COMP/DECOMP AECS buffers
[Init] COMP AECS loaded:   addr=0x712ea4114040 size=1568
[Init] DECOMP AECS loaded: addr=0x712ea4119140 size=5376
[Init] Initing SETUP MSG...
[Init] All systems OK. Staging Buffer: 32 MB (Hugepages)
[Init] Sending SETUP Message to SNIC...
[SETUP] comp_aecs_addr=0x712ea4114040 comp_aecs_size=1568
[SETUP] decomp_aecs_addr=0x712ea4119140 decomp_aecs_size=5376
[Init] SETUP Message Sent successfully.
sizeof(struct snic_setup_msg) = 80

job0: (groupid=0, jobs=1): err= 0: pid=19079: Thu Mar 26 15:29:44 2026
  read: IOPS=500, BW=62.5MiB/s (65.5MB/s)(128KiB/2msec)
    clat (nsec): min=1312.9k, max=1312.9k, avg=1312945.00, stdev= 0.00
     lat (nsec): min=1313.8k, max=1313.8k, avg=1313778.00, stdev= 0.00
    clat percentiles (usec):
     |  1.00th=[ 1319],  5.00th=[ 1319], 10.00th=[ 1319], 20.00th=[ 1319],
     | 30.00th=[ 1319], 40.00th=[ 1319], 50.00th=[ 1319], 60.00th=[ 1319],
     | 70.00th=[ 1319], 80.00th=[ 1319], 90.00th=[ 1319], 95.00th=[ 1319],
     | 99.00th=[ 1319], 99.50th=[ 1319], 99.90th=[ 1319], 99.95th=[ 1319],
     | 99.99th=[ 1319]
  lat (msec)   : 2=100.00%
  cpu          : usr=0.00%, sys=0.00%, ctx=1, majf=0, minf=61
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0.00ns, window=0.00ns, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=62.5MiB/s (65.5MB/s), 62.5MiB/s-62.5MiB/s (65.5MB/s-65.5MB/s), io=128KiB (131kB), run=2-2msec

Disk stats (read/write):
  nvme1n1: ios=0/0, sectors=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%